<template>
  <div class="faq">
    <div class="container">
      <div class="faq-wrapper">
        <div class="faq-header">
          <h2 class="title">Часто задаваемые вопросы</h2>
        </div>
        <div class="faq-body">
          <div class="row">
            <div class="col-lg-9">
              <div
                v-for="(question, index) in questions"
                :key="question.id"
                class="faq-body-list"
                role="tablist"
              >
                <div class="question-items">
                  <button
                    class="accordion-btn"
                    block
                    v-b-toggle="'accordion-productdetails' + index"
                    variant="info"
                    role="tab"
                  >
                    <h3>{{ question.title }}</h3>
                    <i class="icon-plus"></i>
                  </button>

                  <b-collapse
                    :id="'accordion-productdetails' + index"
                    accordion="my-accordion"
                    role="tabpanel"
                    class="question-items-text"
                  >
                    {{ question.text }}
                  </b-collapse>
                </div>
              </div>
            </div>
            <div class="col-lg-3">
              <CardSidebarBanner />
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      questions: [
        {
          title: "Как настроить часто задаваемые вопросы в MUNIS ?",
          text: `28 октября 2020 года Совет директоров Всемирного банка одобрил проект «Модернизация 
                 национальной инновационной системы Узбекистана» с предоставлением финансовых средств 
                 в размере 50 млн. долларов США. Исполнительным органом данного проекта является 
                 Министерство Инновационного развития (МИР) Республики Узбекистан.`,
        },
        {
          title: "Что мы можем вам порекомендовать ?",
          text: `28 октября 2020 года Совет директоров Всемирного банка одобрил проект «Модернизация 
                 национальной инновационной системы Узбекистана» с предоставлением финансовых средств 
                 в размере 50 млн. долларов США. Исполнительным органом данного проекта является 
                 Министерство Инновационного развития (МИР) Республики Узбекистан.`,
        },
        {
          title: "Где мы находимся ?",
          text: `28 октября 2020 года Совет директоров Всемирного банка одобрил проект «Модернизация 
                 национальной инновационной системы Узбекистана» с предоставлением финансовых средств 
                 в размере 50 млн. долларов США. Исполнительным органом данного проекта является 
                 Министерство Инновационного развития (МИР) Республики Узбекистан.`,
        },
        {
          title: "С какими компаниями у нас отношения ?",
          text: `28 октября 2020 года Совет директоров Всемирного банка одобрил проект «Модернизация 
                 национальной инновационной системы Узбекистана» с предоставлением финансовых средств 
                 в размере 50 млн. долларов США. Исполнительным органом данного проекта является 
                 Министерство Инновационного развития (МИР) Республики Узбекистан.`,
        },
        {
          title: "Как настроить часто задаваемые вопросы в MUNIS ?",
          text: `28 октября 2020 года Совет директоров Всемирного банка одобрил проект «Модернизация 
                 национальной инновационной системы Узбекистана» с предоставлением финансовых средств 
                 в размере 50 млн. долларов США. Исполнительным органом данного проекта является 
                 Министерство Инновационного развития (МИР) Республики Узбекистан.`,
        },
        {
          title: "Как настроить часто задаваемые вопросы в MUNIS ?",
          text: `28 октября 2020 года Совет директоров Всемирного банка одобрил проект «Модернизация 
                 национальной инновационной системы Узбекистана» с предоставлением финансовых средств 
                 в размере 50 млн. долларов США. Исполнительным органом данного проекта является 
                 Министерство Инновационного развития (МИР) Республики Узбекистан.`,
        },
      ],
    };
  },
};
</script>

<style>
</style>